# Trevor O'Connell
## Week 13: 11/19/2020
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [3]:
#mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [4]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [5]:
df['state']= df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [8]:
#apply
def meter(x):
    return x /3.2808

In [9]:
df['altitude'] = df['altitude'].apply(meter)

df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [10]:
df = DataFrame(np.random.randn(4,3), columns =list('bde'),
              index=['UT','OH','TX','OR'])

df

           b         d         e
UT -1.823340  1.605771  1.288660
OH -0.191361  1.572898 -0.791561
TX -0.979713 -0.928684  0.828328
OR  0.593391  0.320375  1.111011

In [11]:
def dif(x):
    return x.max() - x.min()

In [12]:
df.apply(dif)

b    2.416731
d    2.534455
e    2.080221
dtype: float64

In [13]:
df.apply(dif,axis=1)

UT    3.429111
OH    2.364459
TX    1.808042
OR    0.790636
dtype: float64

In [14]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.823340  1.0  0.0  0.0
-0.979713  1.0  0.0  0.0
-0.928684  0.0  1.0  0.0
-0.791561  0.0  0.0  1.0
-0.191361  1.0  0.0  0.0
 0.320375  0.0  1.0  0.0
 0.593391  1.0  0.0  0.0
 0.828328  0.0  0.0  1.0
 1.111011  0.0  0.0  1.0
 1.288660  0.0  0.0  1.0
 1.572898  0.0  1.0  0.0
 1.605771  0.0  1.0  0.0

In [16]:
#groupby
df = DataFrame({'k1':['a','a','b','b','c'],
               'k2':['one','two','one','two','one'],
               'dataset1':np.random.randn(5),
               'dataset2': np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one  0.135933  0.100071
1  a  two -0.289577 -1.635291
2  b  one  1.058144 -0.256321
3  b  two -0.618184 -1.370783
4  c  one -0.709460 -0.013904

In [17]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [18]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [19]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [20]:
df

  k1   k2  dataset1  dataset2
0  a  one  0.135933  0.100071
1  a  two -0.289577 -1.635291
2  b  one  1.058144 -0.256321
3  b  two -0.618184 -1.370783
4  c  one -0.709460 -0.013904

In [21]:
df['dataset1'].groupby(df['k1']).mean()

k1
a   -0.076822
b    0.219980
c   -0.709460
Name: dataset1, dtype: float64

In [22]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a  -0.076822 -0.767610
b   0.219980 -0.813552
c  -0.709460 -0.013904

In [23]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.135933  0.100071
   two -0.289577 -1.635291
b  one  1.058144 -0.256321
   two -0.618184 -1.370783
c  one -0.709460 -0.013904

In [26]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  0.135933
   two -0.289577
b  one  1.058144
   two -0.618184
c  one -0.709460